In [1]:
import pandas as pd

In [3]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [6]:
result = pd.concat([df1, df2], ignore_index= True) 
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [8]:
result2= df1.append(df2, ignore_index= True)
result2

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [14]:
l3= [{'name': 'john', 'job': "teacher"},
     {'name': 'nate', 'job': "student"},
     {'name': 'jack', 'job': "developer"} ]
l4 = [{'age': 25, 'country': 'US'},
      {'age': 30, 'country': 'UK'},
       {'age': 45, 'country': 'KOR'} ]
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [16]:
result3= pd.concat([df1,df2], axis=1, ignore_index= True) #í–‰ axis
result3

      0          1   2    3
0  john    teacher  25   US
1  nate    student  30   UK
2  jack  developer  45  KOR

### Concatenate two list as a dataframe

In [18]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparison = pd.DataFrame( {'label': label,'prediction': prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5